//მომხმარებელს შეეკითხე ქულა (0–100).,
//თუ ქულა 90-ზე მეტია → "შესანიშნავი!"
//თუ 70–90 შორისაა → "კარგია!"
//თუ 50–70 შორისაა → "საშუალო შედეგი!"
//თუ ნაკლებია 50-ზე → "მეტი უნდა იმეცადინო!"

const num = Number(prompt("(0-100)"));

if(num > 90) {
    console.log("შესანიშნავია");
}
else if(num >= 70 && 90 <= num) {
    console.log("კარგია");
}
else if(num >= 50 && 70 <= num) {
    console.log("საშვალო შედეგი");
}
else if(num < 50) {
    console.log("მეტი უნდა იმეცადინო");
}
else {
    console.log("არასწორია")
}