// შექმენით ობიექტი სადაც შეინახავთ რომელიმე ფილმის სახელს, გამოშვების წელს და შეფასებას.
//  შემდეგ ობიექტის გარეთ მომხმარებელს შეეკითხეთ თუ უნდა რომ ფილმი შეაფასოს, თუ უნდა რომ შეაფასოს მაშინ გაანახლეთ მისი მნიშვნელობა.
//  თუ არ უნდა განახლება ობიექტის შიგნით არსებული მეთოდი გამოიძახეთ რომელიც დააბრუნებს ტექტს "თქვენ არ შეგიფასებიათ ფილმი",

let film = {
    name: "inception",
    year: 2010,
    grade: 9,
    notgraded: function(){
        return "არა შეგიფასებით"
    }
}

let answer = Prompt("გინდა ფილმი შეაფასოთ")

if(answer === "კი"){
    let newgrade = Prompt()
    film.grade = Number(newgrade)
}
else{
    console.log(film.notgraded)
}