// შექმენით 3 ელემენტიანი სია. და სიის დასაწყისში დაამატეთ თქვენი სახელი. და სიის ბოლოდან ამოშალეთ ბოლო ინდექსზე მდგომი ელემენტი

let list = ["erekle", "nugo", "pavle"]
list.unshift("Giorgi")
list.pop()

// შექმენით 5 ელემენტიანი სია და სიის ბოლოში დაამატეთ თქვენი ასაკი

let arrey = [15, 13, 18, 17, 14]
arrey.push(16)

// შექმენით 5 ელემენტიანი სია. და მე-3 ინდექსზე დაამატეთ "Goa" და ბოლო ელემენტი წაშალეთ.

let list1 = ["Android", "apple", "xiomi", "oneplus", "samsung"]
list1.splice(3, 1, "GOA")
list1.pop()