// ეიჩტიემელში შექმენით ორი პარაგრაფი რომელიც იქნება მოთავსებული დივში და პირველ პ ში ჩაწერეთ true მეორეში false

// თქვენი დავალებაა ჯს ში შექმნათ ცვლადი რომელსაც მიანშებთ true ან false

// შემდეგ თქვენი დავალებაა რომ თუ ცვლადში შენახული მნშვნელობა არის true/truthy მაშინ ამოშალოთ მეორე პარაგრაფი დივიდან
 
// სხვა შემთხვევაში კი ამოშალეთ პირველი პარაგრაფი დივიდან გამოიყენეთ .remove() მეთოდი ამ დავალების შესასრულებლად

let random = true

let p1 = document.getElementById("p1")
let p2 = document.getElementById("p2")

if(random){
    p2.remove()
}
else{
    p1.remove()
}