// შექმენი პროგრამა, სადაც მომხმარებელი შეიყვანს რიცხვს. ეს რიცხვი იქნება პაროლი. პროგრამამ უნდა დაითვალოს რამდენად ძლიერია მომხმარებლის მიერ შეყვანილი პაროლი.
//  და შეამოწმოს ნამდვილად რიცხვი არის თუ არა.
//  1 . თუ შეყვანილი სიმბოლოების რაოდენობა მეტია ან ტოლი 6-ზე მაშინ +10  ქულა. თუ 3-6 შუალედშია სიმბოლოების რაოდენობა მაშინ 5 ქულა. სხვა შემთხვევაში 0.
//  2 . თუ ამ რიცხვის ციფრთა ჯამი მეტია 20-ზე მაშინ + 10 ქულა. თუ 15-20 შუალედშია მაშინ 5 ქულა. სხვა შემთხვევაში 0 ქულა. 
// თუ ქულების საერთო ჯამი მეტი იქნება 15-ზე მაშინ დააბრუნეთ რომ "პაროლი არის ძლიერი".
//  თუ 10-დან 15-მდეა მაშინ "საშუალო სირთულის" სხვა შემთხვევაში დააბრუნეთ "პაროლი სუსტია".
//  (string-ად არ გადააქციოთ ეს რიცხვი და ისე არ გაიგთ ციფრთა ჯამი ან სიგრძე. გამოიყენეთ Math ობიექტი )

let func = (i) => {
    let grades = 0
    let num = 0

    if(i >= 100000){
        grades += 10
    }
    else if(i < 100000 && i >= 100){
        grades += 5
    }
    else{
        grades += 0
    }

    while(i >= 1){
        i = i/10
        num += (i - Math.floor(i)) * 10
    }

    if(num > 20){
        grades += 10
    }
    else if(num >= 15 && num <= 20){
        grades += 5
    }
    else{
        grades += 0
    }

    if(grades > 15){
        console.log("პაროლი არის ძლიერი")
    }
    else if(grade >= 10 && grade < 15){
        console.log("საშუალო სირთულის")
    }
    else{
        console.log("პაროლი სუსტია")
    }
}