// შექმენი პროგრამა, სადაც მომხმარებელი შეიყვანს რიცხვს. ეს რიცხვი იქნება პაროლი. პროგრამამ უნდა დაითვალოს რამდენად ძლიერია მომხმარებლის მიერ შეყვანილი პაროლი.
//  და შეამოწმოს ნამდვილად რიცხვი არის თუ არა.
//      1  . თუ შეყვანილი სიმბოლოების რაოდენობა მეტია ან ტოლი 6-ზე მაშინ +10  ქულა. თუ 3-6 შუალედშია სიმბოლოების რაოდენობა მაშინ 5 ქულა. სხვა შემთხვევაში 0.


let password = prompt()

let length = password.length
let score = 0

if(length >= 6){
    score = 10
} 
else if(length >= 3 && length < 6){
    score = 5
} 
else{
    score = 0
}

console.log(score)
