//ამჯერად უკვე ლოგიკური ოპერატორების გამოყენებით გააკეთეთ,
// მომხმარებელს შემოატანინეთ რიცხვი და გამოიტანეთ შესაბამისი სეზონი.

const month = Number(prompt("შემოიტანეთ რიცხვი"));

// იანვარი, თებერვალი, მარტი, აპრილი, მაისი, ივნისი, ივლისი, აგვისტო, სექტემბერი, ოქტომბერი, ნოემბერი, დეკემბერი
if(month == 3 || month == 4 || month == 5){
    console.log("გაზაფხული");
}
else if(month == 6 || month == 7 || month == 8){
    console.log("ზაფხული");
}
else if(month == 9 || month == 10 || month == 11){
    console.log("შემოდგომა");
}
else if(month == 12 || month == 1 || month == 2){
    console.log("ზამთარი");
}
else{console.log("შემოიყვანე 1დან 12ტის ჩათვლით რიცხვები")}
