//მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვის ჩათვლით გამოიტანეთ ყველა რიცვხვი.

const num = Number(prompt("რიცხვი"));

for(let i = 0;i < num;i += 1) {
    console.log(i);
}

//მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვის ჩათვლით გამოიტანეთ ყველა ლუწი რიცხვი

const num1 = Number(prompt("რიცხვი"));

for(let i = 0;i < num1;i += 2) {
    console.log(i);
}

//მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვიდან 0-მდე გამოიტანეთ ყველა რიცხვი

const num2 = Number(prompt("რიცხვი"));

for (let i = num2; i >= 0; i--) {
  console.log(i);
}