// შექმენი პროგრამა, სადაც მომხმარებელი შეიყვანს რიცხვს. ეს რიცხვი იქნება პაროლი. პროგრამამ უნდა დაითვალოს რამდენად ძლიერია მომხმარებლის მიერ შეყვანილი პაროლი.
//  და შეამოწმოს ნამდვილად რიცხვი არის თუ არა.
// თუ ამ რიცხვის ციფრთა ჯამი მეტია 20-ზე მაშინ + 10 ქულა. თუ 15-20 შუალედშია მაშინ 5 ქულა. სხვა შემთხვევაში 0 ქულა. 
// თუ ქულების საერთო ჯამი მეტი იქნება 15-ზე მაშინ დააბრუნეთ რომ "პაროლი არის ძლიერი". 
// თუ 10-დან 15-მდეა მაშინ "საშუალო სირთულის" სხვა შემთხვევაში დააბრუნეთ "პაროლი სუსტია". (string-ად არ გადააქციოთ ეს რიცხვი და ისე არ გაიგთ ციფრთა ჯამი ან სიგრძე. 
// გამოიყენეთ Math ობიექტი )

let password = Number(prompt())

let score = 0
let sum = 0
let temp = password

while(temp > 0){
    sum += temp % 10 
    temp = Math.floor(temp / 10)   
}

if(sum > 20){
    score += 10
} 
else if(sum >= 15 && sum <= 20){
    score += 5
} 
else{
    score += 0
}

if(score > 15){
    console.log("პაროლი არის ძლიერი")
}
else if(score >= 10 && score <= 15){
    console.log("პაროლი არის საშუალო")
}
else{
    console.log("პაროლი სუსტია")
}

console.log(score)
