//შექმენი 4 სია ,ერთ სიაში შეინახეთ სულ სტრინგები,მერე სიაში შეინახე სულ ინტეჯერები,
// მესამე სიაში შეინახეთ სულ float ები,და მეოთხე სიაში შეინახეთ სულ boolean ები,
// ასევე შექმენი ბოლოს მეხთე სია სადაც შეინახავ ოთხივე ტიპის მონაცემს ერთად


const names = ["Giorgi", "nika", "erekle", "saba"];

const num = [10, 28, 69, -71];

const mixnum = [3.14, 0.99, -2.5, 10.0];

const truefalse = [true, false, true, false];

const mix = ["საქართველო", 28, 5.5, true];

//შექმენი სია სადაც შეინახავ ორ სტრინგს ორ ნამბერს და კიდევ ერთ სიას,სადაც მოათავსებ მხოლოდ სტრინგებს

let list = ["apple", "orange", 28, 36, list1];
let list1 = ["bmw", "mercedes", "lambo"];