// 1)შექმენი სია სადაც მოთავსებთ 10 ადამიანის სახელს,თქვენი დავალებაა რომ შექმნათ ცვლადი და შეინახოთ ამ ცვლადში შემდეგი მნიშვნელობები
//  --> ელემენტები მესამე ინდექსიდან მე8 ინდექსამდე ////შექმენი მეორე ცვლადი და ამ ცვლადშ შეინახე შემდეგი მნიშვნლელობები --> ელემენტები მე0 ინდექსიდან მე6 ინდექსამდე ,
//  დააკონსოლლოგეთ ორივე ცვლადი რომ ნახოთ ორივე ცვლადში შენახული შედეგები ======>>>>>> გამოიყენეთ slice() ფუნქცია

let list = ["erekle", "tengo", "ilia", "saba", "gio", "levani", "temo", "andria", "soso", "dato"]

let slicer = list.slice(3,8)
let sli = list.slice(0,6)

console.log(slicer)
console.log(sli)